
 FeatEncoder
目前人工智能飞速发展给社会带来了巨大的挑战，请你结合马克思主义理论 分析下， 不少于3000字
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]             864
       BatchNorm2d-2         [-1, 32, 512, 512]              64
             PReLU-3         [-1, 32, 512, 512]              32
            Conv2d-4         [-1, 48, 256, 256]           1,536
       BatchNorm2d-5         [-1, 48, 256, 256]              96
       BatchNorm2d-6         [-1, 32, 512, 512]              64
            Conv2d-7         [-1, 48, 512, 512]          13,824
             PReLU-8         [-1, 48, 512, 512]              48
            Conv2d-9         [-1, 48, 256, 256]          20,736
      BatchNorm2d-10         [-1, 48, 256, 256]              96
    bottleneck_IR-11         [-1, 48, 256, 256]               0
        MaxPool2d-12         [-1, 48, 256, 256]               0
      BatchNorm2d-13         [-1, 48, 256, 256]              96
           Conv2d-14         [-1, 48, 256, 256]          20,736
            PReLU-15         [-1, 48, 256, 256]              48
           Conv2d-16         [-1, 48, 256, 256]          20,736
      BatchNorm2d-17         [-1, 48, 256, 256]              96
    bottleneck_IR-18         [-1, 48, 256, 256]               0
        MaxPool2d-19         [-1, 48, 256, 256]               0
      BatchNorm2d-20         [-1, 48, 256, 256]              96
           Conv2d-21         [-1, 48, 256, 256]          20,736
            PReLU-22         [-1, 48, 256, 256]              48
           Conv2d-23         [-1, 48, 256, 256]          20,736
      BatchNorm2d-24         [-1, 48, 256, 256]              96
    bottleneck_IR-25         [-1, 48, 256, 256]               0
           Conv2d-26         [-1, 64, 128, 128]           3,072
      BatchNorm2d-27         [-1, 64, 128, 128]             128
      BatchNorm2d-28         [-1, 48, 256, 256]              96
           Conv2d-29         [-1, 64, 256, 256]          27,648
            PReLU-30         [-1, 64, 256, 256]              64
           Conv2d-31         [-1, 64, 128, 128]          36,864
      BatchNorm2d-32         [-1, 64, 128, 128]             128
    bottleneck_IR-33         [-1, 64, 128, 128]               0
        MaxPool2d-34         [-1, 64, 128, 128]               0
      BatchNorm2d-35         [-1, 64, 128, 128]             128
           Conv2d-36         [-1, 64, 128, 128]          36,864
            PReLU-37         [-1, 64, 128, 128]              64
           Conv2d-38         [-1, 64, 128, 128]          36,864
      BatchNorm2d-39         [-1, 64, 128, 128]             128
    bottleneck_IR-40         [-1, 64, 128, 128]               0
        MaxPool2d-41         [-1, 64, 128, 128]               0
      BatchNorm2d-42         [-1, 64, 128, 128]             128
           Conv2d-43         [-1, 64, 128, 128]          36,864
            PReLU-44         [-1, 64, 128, 128]              64
           Conv2d-45         [-1, 64, 128, 128]          36,864
      BatchNorm2d-46         [-1, 64, 128, 128]             128
    bottleneck_IR-47         [-1, 64, 128, 128]               0
      EqualConv2d-48        [-1, 512, 128, 128]         295,424
  ScaledLeakyReLU-49        [-1, 512, 128, 128]               0
      EqualConv2d-50        [-1, 512, 128, 128]       2,359,808
      EqualConv2d-51        [-1, 512, 128, 128]         295,424
  ScaledLeakyReLU-52        [-1, 512, 128, 128]               0
      EqualConv2d-53        [-1, 512, 128, 128]       2,359,808
================================================================
Total params: 5,647,344
Trainable params: 5,647,344
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 1528.00
Params size (MB): 21.54
Estimated Total Size (MB): 1552.54
----------------------------------------------------------------


----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [2, 32, 512, 512]             864
       BatchNorm2d-2          [2, 32, 512, 512]              64
             PReLU-3          [2, 32, 512, 512]              32
            Conv2d-4          [2, 48, 256, 256]           1,536
       BatchNorm2d-5          [2, 48, 256, 256]              96
       BatchNorm2d-6          [2, 32, 512, 512]              64
            Conv2d-7          [2, 48, 512, 512]          13,824
             PReLU-8          [2, 48, 512, 512]              48
            Conv2d-9          [2, 48, 256, 256]          20,736
      BatchNorm2d-10          [2, 48, 256, 256]              96
    bottleneck_IR-11          [2, 48, 256, 256]               0
        MaxPool2d-12          [2, 48, 256, 256]               0
      BatchNorm2d-13          [2, 48, 256, 256]              96
           Conv2d-14          [2, 48, 256, 256]          20,736
            PReLU-15          [2, 48, 256, 256]              48
           Conv2d-16          [2, 48, 256, 256]          20,736
      BatchNorm2d-17          [2, 48, 256, 256]              96
    bottleneck_IR-18          [2, 48, 256, 256]               0
        MaxPool2d-19          [2, 48, 256, 256]               0
      BatchNorm2d-20          [2, 48, 256, 256]              96
           Conv2d-21          [2, 48, 256, 256]          20,736
            PReLU-22          [2, 48, 256, 256]              48
           Conv2d-23          [2, 48, 256, 256]          20,736
      BatchNorm2d-24          [2, 48, 256, 256]              96
    bottleneck_IR-25          [2, 48, 256, 256]               0
           Conv2d-26          [2, 64, 128, 128]           3,072
      BatchNorm2d-27          [2, 64, 128, 128]             128
      BatchNorm2d-28          [2, 48, 256, 256]              96
           Conv2d-29          [2, 64, 256, 256]          27,648
            PReLU-30          [2, 64, 256, 256]              64
           Conv2d-31          [2, 64, 128, 128]          36,864
      BatchNorm2d-32          [2, 64, 128, 128]             128
    bottleneck_IR-33          [2, 64, 128, 128]               0
        MaxPool2d-34          [2, 64, 128, 128]               0
      BatchNorm2d-35          [2, 64, 128, 128]             128
           Conv2d-36          [2, 64, 128, 128]          36,864
            PReLU-37          [2, 64, 128, 128]              64
           Conv2d-38          [2, 64, 128, 128]          36,864
      BatchNorm2d-39          [2, 64, 128, 128]             128
    bottleneck_IR-40          [2, 64, 128, 128]               0
        MaxPool2d-41          [2, 64, 128, 128]               0
      BatchNorm2d-42          [2, 64, 128, 128]             128
           Conv2d-43          [2, 64, 128, 128]          36,864
            PReLU-44          [2, 64, 128, 128]              64
           Conv2d-45          [2, 64, 128, 128]          36,864
      BatchNorm2d-46          [2, 64, 128, 128]             128
    bottleneck_IR-47          [2, 64, 128, 128]               0
      EqualConv2d-48         [2, 512, 128, 128]         295,424
  ScaledLeakyReLU-49         [2, 512, 128, 128]               0
      EqualConv2d-50         [2, 512, 128, 128]       2,359,808
      EqualConv2d-51         [2, 512, 128, 128]         295,424
  ScaledLeakyReLU-52         [2, 512, 128, 128]               0
      EqualConv2d-53         [2, 512, 128, 128]       2,359,808
================================================================
Total params: 5,647,344
Trainable params: 5,647,344
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 6.00
Forward/backward pass size (MB): 3056.00
Params size (MB): 21.54
Estimated Total Size (MB): 3083.54
----------------------------------------------------------------

